example_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     my_icoReactingMultiphaseInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          0.001;

writeControl    adjustableRunTime;//adjustableRunTime;// timeStep

writeInterval   0.005;

purgeWrite      0;

writeFormat    binary; // binary, ascii

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxDeltaT       1e-1;

maxCo           1.5;
maxAlphaCo      1.5;
maxAlphaDdt     1;

// functions
// {
//     writeObjects1
//     {
//        type            writeObjects;
//        libs            ("libutilityFunctionObjects.so");
//        objects         (alphat epsilon k nut p_rgh);
//        writeOption     noWrite;
//        writeControl    adjustableRunTime;
//        writeInterval   0.01;
//     }
//     writeObjects2
//     {
//        type            writeObjects;
//        libs            ("libutilityFunctionObjects.so");
//        objects         (U p T alpha.liquid alpha.gas SourceU SpongeU);
//        writeOption     autoWrite;
//        writeControl    adjustableRunTime;
//        writeInterval   0.01;
//     }
// 
// }

// ************************************************************************* //
