example_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       100170;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       100270;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1480;
        startFace       100370;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1480;
        startFace       101850;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9250;
        startFace       103330;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9250;
        startFace       112580;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
