example_case/0.orig/SpongeU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      SpongeU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/defineGlobalVars"

dimensions      [1 -3 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    bottom
    {
        type        fixedValue;
        value       uniform  ($Sp 0.0 0.0);
    }
    top
    {
        type        fixedValue;
        value       $internalField;
    }
    left
    {
        type        cyclic;
    }
    right
    {
        type        cyclic;
    }
    front
    {
        type        cyclic;
    }
    back
    {
        type        cyclic;
    }
}

// ************************************************************************* //
