example_case/system/defineGlobalVars
x0  -0.5;
y0  -0.01;
Lx   0.5;
Ly   0.01;
U10  1.0;
SU   140.0;
Tw   300.15;
Ta   298.15;
Sp   -0.0001;
bot6 -0.9;
#include "int_lvls"
