example_case/system/int_lvls
z0 -1.000000;
z1 -0.350000;
z2 -0.250000;
z3 -0.150000;
z4 -0.130000;
z5 -0.110000;
z6 -0.090000;
z7 -0.070000;
z8 -0.050000;
z9 -0.047500;
z10 -0.045000;
z11 -0.042500;
z12 -0.040000;
z13 -0.037500;
z14 -0.035000;
z15 -0.032500;
z16 -0.030000;
z17 -0.027500;
z18 -0.025000;
z19 -0.022500;
z20 -0.020000;
z21 -0.017500;
z22 -0.015000;
z23 -0.012500;
z24 -0.010000;
z25 -0.007500;
z26 -0.005000;
z27 -0.002500;
z28 0.000000;
z29 0.002500;
z30 0.005000;
z31 0.007500;
z32 0.010000;
z33 0.012500;
z34 0.015000;
z35 0.017500;
z36 0.020000;
z37 0.022500;
z38 0.025000;
z39 0.027500;
z40 0.030000;
z41 0.032500;
z42 0.035000;
z43 0.037500;
z44 0.040000;
z45 0.042500;
z46 0.045000;
z47 0.047500;
z48 0.050000;
z49 0.070000;
z50 0.090000;
z51 0.110000;
z52 0.130000;
z53 0.150000;
z54 0.250000;
z55 0.350000;
Lz 1.000000;
